// --------------------------------------------------
// 機能       : template_practice3
// 新規作成日 ： 2021-02-20
// 最終更新日 ： 2021-02-20
// 作成者     : T. TANAKA
// --------------------------------------------------

/* --------------------------------------------------
◆参考文献：
C++11 範囲ベース for ループ 入門.html
http://vivi.dyndns.org/tech/cpp/range-for.html
-------------------------------------------------- */

// --------------------------------------------------
// Include directive
// --------------------------------------------------
#include <iostream>
//#include <cstdio>
//#include <string>
#include <vector>

// --------------------------------------------------
// Using declaration
// --------------------------------------------------
using std::cout;
using std::endl;

using std::string;
//using std::printf;
using std::vector;

// --------------------------------------------------
// Function declaration
// --------------------------------------------------
void vec_int(void);
void vec_string(void);

// --------------------------------------------------
// main function
// --------------------------------------------------
int main()
{
    vec_int();
    vec_string();

    return 0;
}

// --------------------------------------------------
void vec_int(void)
{
    vector<int> v{1, 2, 3, 4, 5, 6, 7};
    for(int x : v) {
        cout << x << endl;
    }
}

// --------------------------------------------------
void vec_string(void)
{
    vector<string> v{"tokyo", "osaka", "kyoto", "nara", "shiga"};
    for(string x : v) {
        cout << x << endl;
    }
}


// --------------------------------------------------
// EOF
// --------------------------------------------------
